# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [13]:
series_1 = pd.Series(np.random.randint(low=1,high=5,size=100))
series_2 = pd.Series(np.random.randint(low=1,high=4,size=100))
series_3 = pd.Series(np.random.randint(low=10000,high=30001,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [17]:
df = pd.concat([series_1,series_2,series_3],axis=1)
df.tail()

    0  1      2
95  2  1  11027
96  3  3  14494
97  4  3  10736
98  1  1  13460
99  4  2  16927

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [18]:
df.columns = ['bedrs','bathrs','price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       3       1            10520
1       2       1            16205
2       2       2            22407
3       3       1            16938
4       3       2            25091
..    ...     ...              ...
95      2       1            11027
96      3       3            14494
97      4       3            10736
98      1       1            13460
99      4       2            16927

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [39]:
bigcolumn = pd.concat([series_1,series_2,series_3])

In [40]:
bigcolumn = bigcolumn.to_frame()

In [41]:
bigcolumn

        0
0       3
1       2
2       2
3       3
4       3
..    ...
95  11027
96  14494
97  10736
98  13460
99  16927

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [42]:
# Yes it seems like it, but we have 300 rows
bigcolumn.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [43]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

         0
0        3
1        2
2        2
3        3
4        3
..     ...
295  11027
296  14494
297  10736
298  13460
299  16927

[300 rows x 1 columns]